<a href="https://colab.research.google.com/github/haruka6532/python/blob/master/01_Python%E5%85%A5%E9%96%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
3 + 4

7

In [0]:
print("Hello, World!!")

Hello, World!!

In [0]:
var = "Hello, World!!"
print(var)

Hello, World!!

In [0]:
print(len("30"))

2

In [0]:
print(len(30))

TypeError: ignored

In [0]:
print(3.49)

3.49

In [0]:
l = [1,2,3,4]
print[l]

TypeError: ignored

In [0]:
l = [1,2,3,4]
print(1)

1

In [0]:
l = [1,2,3,4]
print(l)

[1, 2, 3, 4]

In [0]:
d = {}

In [0]:
d = {
    "apple" = 100
    "grape" = 200
}
print(d["apple"])

SyntaxError: ignored

In [0]:
d = {
    "apple": 100,
    "orange": 200,
    "kiwi": 300
}
print(d["apple"])

100

In [0]:
d = {
    "apple" : 100,
    "grape" : 200
}
print(d["apple"])

100

In [0]:
l = [1,2,3,4]
for item in l
print(l)

SyntaxError: ignored

In [0]:
l = [1,2,3,4]
for item in l:
print(l)

IndentationError: ignored

In [0]:
l = [1,2,3,4]
for item in l:
print(item)

IndentationError: ignored

In [0]:
l = [1,2,3,4]
for item in l:
 print(item)

1
2
3
4

In [0]:
d = {
    "apple" : 100,
    "grape": 200
}
print("--keys--")
for k in  d.keys():
  print(k)

In [0]:
d = {
    "apple":100
    "grape":200
}
print("--value--")
for v in d.value():
  print(v)

SyntaxError: ignored

In [0]:
d = {
    "apple" : 100
    "grape" : 200
}
print("--values--")

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別"　: ["female", "male","female","male"],
    "年齢" :[53, 21, 31, np.nan],
    "兄弟姉妹" :[0, 1, 1, 2],
    "親子" :[0, 1, 3, 2],
    "生存" :[1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

SyntaxError: ignored

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別"　: ["female", "male","female","male"],
    "年齢" : [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子" : [0, 1, 3, 2],
    "生存" : [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

SyntaxError: ignored

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹": [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index=["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1

In [0]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

In [5]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "性別": ["female", "male", "female", "male"],
    "年齢": [53, 21, 31, np.nan],
    "兄弟姉妹" : [0, 1, 1, 2],
    "親子": [0, 1, 3, 2],
    "生存": [1, 0, 1, 1]
}, index = ["1", "2", "3", "4"])

df

       性別    年齢  兄弟姉妹  親子  生存
1  female  53.0     0   0   1
2    male  21.0     1   1   0
3  female  31.0     1   3   1
4    male   NaN     2   2   1